{
    "447301": {
        "filmId": 447301,
        "nameRu": "Начало",
        "nameEn": "Inception",
        "webUrl": "https://www.kinopoisk.ru/film/447301/",
        "posterUrl": "https://kinopoiskapiunofficial.tech/images/posters/kp/447301.jpg",
        "posterUrlPreview": "https://kinopoiskapiunofficial.tech/images/posters/kp_small/447301.jpg",
        "year": 2010,
        "filmLength": "02:28",
        "slogan": "Твой разум - место преступления",
        "description": "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил. \n\nИ вот у Кобба появляется шанс исправить ошибки. Его последнее дело может вернуть все назад, но для этого ему нужно совершить невозможное – инициацию. Вместо идеальной кражи Кобб и его команда спецов должны будут провернуть обратное. Теперь их задача – не украсть идею, а внедрить ее. Если у них получится, это и станет идеальным преступлением. \n\nНо никакое планирование или мастерство не могут подготовить команду к встрече с опасным противником, который, кажется, предугадывает каждый их ход. Врагом, увидеть которого мог бы лишь Кобб.",
        "type": "FILM",
        "ratingMpaa": "pg13",
        "ratingAgeLimits": 12,
        "premiereRu": "2010-07-22",
        "distributors": "Каро-Премьер",
        "premiereWorld": "2010-07-08",
        "premiereDigital": null,
        "premiereWorldCountry": "Великобритания",
        "premiereDvd": "2010-12-07",
        "premiereBluRay": "2010-12-07",
        "distributorRelease": "Юниверсал Пикчерс Рус, CP-Digital",
        "countries": [
            {
                "country": "Великобритания"
            },
            {
                "country": "США"
            }
        ],
        "genres": [
            {
                "genre": "боевик"
            },
            {
                "genre": "детектив"
            },
            {
                "genre": "драма"
            },
            {
                "genre": "триллер"
            },
            {
                "genre": "фантастика"
            }
        ],
        "facts": [
            "<a href=\"/name/22879/\" class=\"all\">Джеймс Франко</a> начал вести переговоры с <a href=\"/name/41477/\" class=\"all\">Кристофером Ноланом</a> по поводу роли в фильме. Однако из-за нестыковок в расписании актера он не смог присоединиться к актерской команде. Роль, предназначавшуюся Франко, исполнил <a href=\"/name/9867/\" class=\"all\">Джозеф Гордон-Левитт</a>.",
            "Съемки фильма начались 13 июля 2009 года.",
            "<a href=\"/name/37859/\" class=\"all\">Леонардо ДиКаприо</a> был первым актером, который дал согласие на участие в проекте.",
            "Персонажа <a href=\"/name/37859/\" class=\"all\">Леонардо ДиКаприо</a> зовут Дом Кобб. Коббом представился профессиональный вор в дебютном фильме Нолана — «<a href=\"/film/8350/\" class=\"all\">Преследование</a>» (1998).",
            "Первоначальное название сценария — «Стрела Оливера».",
            "Герои фильма выходят из состояния сна под песню <a href=\"/name/351205/\" class=\"all\">Эдит Пиаф</a> Non, Je Ne Regrette Rien (&laquo;Нет, я ни о чём не жалею&raquo;). <a href=\"/name/32545/\" class=\"all\">Марион Котийяр</a> в 2007 году исполняла роль Эдит Пиаф.",
            "На роль Ариадны <a href=\"/name/41477/\" class=\"all\">Нолан</a> хотел пригласить <a href=\"/name/30191/\" class=\"all\">Эван Рэйчел Вуд</a>, но актриса заявила, что не заинтересована в сотрудничестве. Также на роль Ариадны рассматривались <a href=\"/name/24302/\" class=\"all\">Кира Найтли</a>, <a href=\"/name/227068/\" class=\"all\">Эмили Блант</a>, <a href=\"/name/50626/\" class=\"all\">Эмма Робертс</a>, <a href=\"/name/663393/\" class=\"all\">Джесси Шрэм</a>, <a href=\"/name/1235564/\" class=\"all\">Тейлор Свифт</a> и <a href=\"/name/573710/\" class=\"all\">Кэри Маллиган</a>.",
            "«Начало» стало первым фильмом <a href=\"/name/6409/\" class=\"all\">Тома Беренджера</a> со времен «<a href=\"/film/863/\" class=\"all\">Тренировочного дня</a>» (2001), добравшимся до киноэкранов США.",
            "В процессе переделки сценария помимо прочего изменились и имена главных героев. Персонаж <a href=\"/name/37859/\" class=\"all\">ДиКаприо</a> звался Джейкобом Хэстли, а героиню <a href=\"/name/43503/\" class=\"all\">Эллиота Пейдж</a> (ранее известного как Эллен Пейдж) звали Изабеллой.",
            "Фонетически «Кобб» означает «мечта» (khwab) на санскрите, хинди, урду и пенджаби. В фильме Кобб мечтал попасть обратно домой.",
            "Название фильма, выполненное в стиле лабиринта, напоминает логотип производственной компании <a href=\"/name/41477/\" class=\"all\">Кристофера Нолана</a> «Syncopy».",
            "<a href=\"/name/37859/\" class=\"all\">Леонардо ДиКаприо</a> был первым и единственным кандидатом на роль Кобба.",
            "Впервые <a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> представил идею для будущего фильма студии Warner Bros. после окончания съёмок «<a href=\"/film/712/\" class=\"all\">Бессонницы</a>» (2002). Студии проект понравился, и Нолан получил зеленый свет. Однако в то время сценарий еще не был написан и существовал только в голове у автора. Кристофер посчитал, что ему будет проще написать сценарий, не заключая предварительного контракта, и затем презентовать его студии. По его словам, тогда он рассчитывал завершить сценарий за пару месяцев: ему всего лишь нужно было перенести готовый текст на бумагу. Однако работа над сценарием заняла у Нолана почти восемь лет.",
            "Фильм доставлялся в кинотеатры под названием &laquo;Hour Glass&raquo;.",
            "На одном из этапов производства студия предлагала сделать картину в 3D, однако <a href=\"/name/41477/\" class=\"all\">Нолан</a> отказался, возразив, что трехмерный формат будет лишь отвлекать от истории, рассказанной в фильме.",
            "В сцене вращающегося коридора гостиницы <a href=\"/name/9867/\" class=\"all\">Джозеф Гордон-Левитт</a> сам исполнил все трюки, не прибегая к помощи каскадеров.",
            "Персонаж <a href=\"/name/5005/\" class=\"all\">Киллиана Мёрфи</a>, Роберт Фишер, был назван в честь известного шахматиста <a href=\"/name/1738197/\" class=\"all\">Бобби Фишера</a>. Отец Роберта, Морис Фишер, получил свое имя в честь художника <a href=\"/name/1013441/\" class=\"all\">М.К. Эшера</a> (полное имя &#8211; Мауриц Корнелис Эшер), работы которого послужили вдохновением для многих спецэффектов в фильме. Например, &#171;Лестницы Пенроуза&#187;, которые Артур показывает Ариадне, &#8211; это отсылка к картине М.К. Эшера &#171;Восхождение и спуск&#187;. Эшер известен работами, в которых он исследовал пластические аспекты понятий бесконечности и симметрии, а также особенности психологического восприятия сложных трехмерных объектов.",
            "Арабское имя Юсуф соответствует еврейскому Иосиф. В «Ветхом завете, Бытие 37-50» говорится об Иосифе, обладавшем даром интерпретации снов. Он помог фараону подготовиться к «семи годам голода». Похожая история рассказана в Коране.",
            "Объясняя, почему он считает, что внушение идеи невозможно, Артур говорит «не думай о слонах», чтобы на самом деле заставить Сайто подумать о них, и, таким образом, «внедрить» ему идею. Данная фраза – это ссылка на книгу о когнитивной семантике Джорджа Лакоффа «Не думай о слоне». В книге идет речь о концептуальных фреймах, мысленных структурах, определяющих наше видение мира. Использование фреймов в виде определенных словосочетаний позволяет незаметно внушить человеку нужные идеи.",
            "Ариадна в древнегреческой мифологии — дочь критского царя Миноса и Пасифаи. Когда Тесей решился убить минотавра, он получил от любившей его Ариадны клубок ниток, выведший его из лабиринта, где обитал минотавр.",
            "Героиню <a href=\"/name/32545/\" class=\"all\">Марион Котийяр</a> зовут Мол, сокращенно от Молори (Malorie). Имя происходит от французского слова &#171;Malheur&#187;, что означает неудачу или несчастье.",
            "Персонаж <a href=\"/name/39984/\" class=\"all\">Тома Харди</a>, Имз, назван в честь Чарльза Имза и Рэя Имза, известных дизайнеров мебели и зданий.",
            "Во всех сценах в отеле волосы Ариадны собраны в пучок. Это было сделано намеренно, чтобы облегчить работу команде по спецэффектам, которой не пришлось ломать голову над тем, как должны двигаться волосы в невесомости.",
            "В фильме присутствует около 500 кадров со спецэффектами.",
            "Роль Сайто была специально написана для <a href=\"/name/30759/\" class=\"all\">Кэна Ватанабэ</a>.",
            "Изначально <a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> планировал снять некоторые сцены фильма на камеру формата IMAX 65 миллиметров, однако из-за обильного использования ручных камер во время съёмок, от идеи пришлось отказаться: из-за своего веса 65-миллиметровые камеры не позволяют вести съёмки с рук.",
            "Внешний вид «снежной крепости» Фишера содержит элементы Библиотеки Гайзеля при Университете Калифорнии.",
            "В интервью Entertainment Weekly <a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> заявил, что основные персонажи фильма в той или иной степени повторяют профессии людей, занятых в кинопроизводстве: Кобб – режиссер; Артур – продюсер; Ариадна – художник-постановщик; Имз – актер; Сайто – глава киностудии; Фишер – зритель.",
            "Цифры 3,5,0,2 встречаются по ходу действия фильма в различных комбинациях: 3502 – номер поезда, 2305 – номер такси; 5302 – номер комнаты в отеле.",
            "Если сложить первые буквы имени главных героев — Dom, Robert, Eames, Arthur/Ariadne, Mal, Saito &#8211; получится слово Dreams (сны).",
            "Несмотря на упоминание на постере, <a href=\"/name/3711/\" class=\"all\">Майкл Кейн</a> присутствует на экране всего три минуты.",
            "<a href=\"/name/21709/\" class=\"all\">Кейт Уинслет</a> предлагали сыграть Мол. Она отказалась, т.к. не могла представить себя в данной роли.",
            "<a href=\"/name/2074314/\" class=\"all\">Миранда Нолан</a>, двоюродная сестра <a href=\"/name/41477/\" class=\"all\">Кристофера Нолана</a>, сыграла стюардессу.",
            "«Начало» — это уже третий фильм <a href=\"/name/41477/\" class=\"all\">Нолана</a>, в котором у персонажа <a href=\"/name/5005/\" class=\"all\">Киллиана Мёрфи</a> надет на голову мешок.",
            "Продолжительность фильма (2 часа 28 минут) — отсылка к песне <a href=\"/name/351205/\" class=\"all\">Эдит Пиаф</a> &laquo;Non, je ne regrette rien&raquo;, первая студийная запись которой длилась 2 минуты 28 секунд. Песня часто звучит в фильме и помогает героям &laquo;выпрыгнуть&raquo; из сна.",
            "В фильме звучит 399 вопросов, большинство из которых задают Кобб (113), Ариадна (93) и Артур (44)."
        ],
        "seasons": [],
        "kp_rate": "8.661",
        "imdb_rate": "8.8",
        "secret": {
            "result": false
        }
    },
    "195334": {
        "filmId": 195334,
        "nameRu": "Престиж",
        "nameEn": "The Prestige",
        "webUrl": "https://www.kinopoisk.ru/film/195334/",
        "posterUrl": "https://kinopoiskapiunofficial.tech/images/posters/kp/195334.jpg",
        "posterUrlPreview": "https://kinopoiskapiunofficial.tech/images/posters/kp_small/195334.jpg",
        "year": 2006,
        "filmLength": "02:05",
        "slogan": "Дружба, ставшая соперничеством. Соперничество, превратившееся во вражду",
        "description": "Роберт и Альфред - фокусники-иллюзионисты, которые на рубеже XIX и XX веков соперничали друг с другом в Лондоне. С годами их дружеская конкуренция на профессиональной почве перерастает в настоящую войну.\n\nОни готовы на все, чтобы выведать друг у друга секреты фантастических трюков и сорвать их исполнение. Непримиримая вражда, вспыхнувшая между ними, начинает угрожать жизни окружающих их людей…",
        "type": "FILM",
        "ratingMpaa": "pg13",
        "ratingAgeLimits": 16,
        "premiereRu": "2006-12-24",
        "distributors": "Каро-Премьер",
        "premiereWorld": "2006-10-17",
        "premiereDigital": null,
        "premiereWorldCountry": "Италия",
        "premiereDvd": "2011-10-13",
        "premiereBluRay": "2009-09-15",
        "distributorRelease": "CP-Digital, Юниверсал Пикчерс Рус",
        "countries": [
            {
                "country": "Великобритания"
            },
            {
                "country": "США"
            }
        ],
        "genres": [
            {
                "genre": "детектив"
            },
            {
                "genre": "драма"
            },
            {
                "genre": "триллер"
            },
            {
                "genre": "фантастика"
            }
        ],
        "facts": [
            "Создатель «<a href=\"/film/351/\" class=\"all\">Красоты по-американски</a>» <a href=\"/name/23522/\" class=\"all\">Сэм Мендес</a> безумно хотел перенести роман «Престиж» на экран, но автор романа <a href=\"/name/1004655/\" class=\"all\">Кристофер Прист</a> настоял на том, чтобы экранизацией занялся <a href=\"/name/41477/\" class=\"all\">Нолан</a>, настолько он был впечатлен фильмами «<a href=\"/film/8350/\" class=\"all\">Преследование</a>» и «<a href=\"/film/335/\" class=\"all\">Помни</a>».",
            "Роль фокусника Милтона исполнил настоящий иллюзионист <a href=\"/name/11538/\" class=\"all\">Рикки Джей</a>. Помимо всего прочего, он преподавал уроки фокусов <a href=\"/name/21495/\" class=\"all\">Бэйлу</a> и <a href=\"/name/8213/\" class=\"all\">Джекману</a>.",
            "Во время сцены с ловлей пули в списке исполнителей значится имя Гари Дрезден. На самом деле Гарри Дрезден – это вымышленный волшебник, герой серии книжек «Записки Дрездена», созданных <a href=\"/name/1192669/\" class=\"all\">Джимом Батчером</a>.",
            "Фокусник Чанг Линг Су – не вымышленный герой. Скончался он на сцене, когда неудачно исполнил трюк «Поймай пулю». ",
            "<a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> написал сценарий в соавторстве со своим братом Джонатаном. Они основательно переделали сюжет книги; в частности, убрали всю современную линию, а также сделали Анджиэра и Бордена приятелями еще до их смертельного противостояния. В книге главные герои не были знакомы друг с другом, пока не началась их вражда.",
            "<a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> планировал снять этот фильм ещё до «<a href=\"/film/47237/\" class=\"all\">Бэтмена: Начало</a>».",
            "На раннем этапе производства режиссёр <a href=\"/name/41477/\" class=\"all\">Нолан</a> планировал на одну из главных ролей <a href=\"/name/15703/\" class=\"all\">Джуда Лоу</a>.",
            "<a href=\"/name/13176/\" class=\"all\">Энди Серкис</a>, исполнитель роли Голлума в трилогии «Властелин колец», стал последним актёром, присоединившимся к звёздному составу фильма. Он сыграл мистера Элли, ассистента изобретателя Тесла.",
            "Съёмки картины продолжались с января по апрель 2006 года в Калифорнии, США. ",
            "Слово «престиж» упоминается в рекламном ролике фильма как «эффект, который производит магический трюк на аудиторию, не способную разгадать его тайну». В романе-первооснове это слово имеет и другой, по-настоящему мистический характер.",
            "Фильм снят по мотивам романа <a href=\"/name/1004655/\" class=\"all\">Кристофера Приста</a> «Престиж» (The Prestige, 1995)."
        ],
        "seasons": [],
        "kp_rate": "8.519",
        "imdb_rate": "8.5",
        "secret": {
            "result": false
        }
    },
    "1236063": {
        "filmId": 1236063,
        "nameRu": "Довод",
        "nameEn": "Tenet",
        "webUrl": "https://www.kinopoisk.ru/film/1236063/",
        "posterUrl": "https://kinopoiskapiunofficial.tech/images/posters/kp/1236063.jpg",
        "posterUrlPreview": "https://kinopoiskapiunofficial.tech/images/posters/kp_small/1236063.jpg",
        "year": 2020,
        "filmLength": "02:30",
        "slogan": "Время уходит",
        "description": "После теракта в киевском оперном театре агент ЦРУ объединяется с британской разведкой, чтобы противостоять русскому олигарху, который сколотил состояние на торговле оружием. Для этого агенты используют инверсию времени — технологию будущего, позволяющую времени идти вспять.",
        "type": "FILM",
        "ratingMpaa": "pg13",
        "ratingAgeLimits": 16,
        "premiereRu": "2020-09-03",
        "distributors": "Каро-Премьер",
        "premiereWorld": "2020-08-22",
        "premiereDigital": null,
        "premiereWorldCountry": "Австралия",
        "premiereDvd": null,
        "premiereBluRay": null,
        "distributorRelease": "",
        "countries": [
            {
                "country": "Великобритания"
            },
            {
                "country": "США"
            }
        ],
        "genres": [
            {
                "genre": "боевик"
            },
            {
                "genre": "триллер"
            },
            {
                "genre": "фантастика"
            }
        ],
        "facts": [
            "В фильме есть планы и детали, которые <a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> обдумывал около 20 лет. Написание сценария у него заняло 6 лет.",
            "Рабочее название фильма — &laquo;Карусель&raquo; (\"Merry-Go-Round\").",
            "В фильме всего 280 кадров с компьютерной графикой, остальное — живые съемки с применением практических спецэффектов.",
            "По словам <a href=\"/name/544406/\" class=\"all\">Роберта Паттинсона</a>, акцент, интонацию и манеры для своего персонажа он перенял у американского журналиста и писателя <a href=\"/name/386253/\" class=\"all\">Кристофера Хитченса</a>.",
            "Съёмки проходили в обстановке строжайшей секретности. <a href=\"/name/544406/\" class=\"all\">Роберт Паттинсон</a> рассказывал, что сценарий ему дали прочесть только в запертой комнате в штаб-квартире Warner Bros, <a href=\"/name/3711/\" class=\"all\">Майклу Кейну</a> дали прочесть только те сцены, в которых ему предстояло сняться, а не весь сценарий. Кейн признался журналистам, что понятия не имеет, о чём фильм, хотя был близким другом <a href=\"/name/41477/\" class=\"all\">Кристофера Нолана</a>.",
            "Авторы фильма приобрели, а затем разбили в ангаре настоящий «Боинг», так что обошлись без компьютерной графики.",
            "Перед съёмками своих фильмов <a href=\"/name/41477/\" class=\"all\">Кристофер Нолан</a> собирает съёмочную группу и актёрский состав и устраивает просмотр фильмов, в которых черпал вдохновение, работая над текущим проектом. Перед началом съёмок этого фильма Нолан традицию нарушил. Ему хотелось, чтобы творческая группа полагалась на память и ощущения, а не пыталась воссоздать когда-то увиденное.",
            "В фильме можно найти части древнего палиндрома, который использовался для защиты дома или человека. Помещённый в квадрат палиндром читается во всех направлениях по вертикали и горизонтали.<br>\nSATOR<br>\nAREPO<br>\nTENET<br>\nOPERA<br> \nROTAS<br>\nНазвание фильма — Tenet, фамилия одного из главных героев — Сатор, его компания называется &#171;Ротас&#187;, одна из сцен происходит в опере, фамилия испанского художника — Арепо.",
            "Самый дорогой на момент выхода фильм <a href=\"/name/41477/\" class=\"all\">Кристофера Нолана</a>.",
            "Съёмки так измотали <a href=\"/name/117084/\" class=\"all\">Джона Дэвида Вашингтона</a>, что после их окончания он ещё месяц не мог бегать.",
            "Съёмки проходили в Дании, Эстонии, Индии, Италии, Норвегии, Великобритании и США. Съёмки в США начались в мае и закончились в середине ноября 2019 года."
        ],
        "seasons": [],
        "kp_rate": "7.544",
        "imdb_rate": "7.3",
        "secret": {
            "result": false
        }
    }
}